Revit 2027 API
BuiltInFailures.SkylightFailures Class
 Failures about Skylight.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SkylightFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SkylightFailures
Public NotInheritable Class SkylightFailures
public ref class SkylightFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SkylightFailures = class end
The BuiltInFailures.SkylightFailures type exposes the following members.
Properties
Name | Description
MinSkylightWidthImperial |  The minimum skylight width is 8 inches.
MinSkylightWidthMetric |  The minimum skylight width is 203.2 millimeters.
Top
See Also
Reference
Autodesk.Revit.DB Namespace